{
  "nav.about": "ABOUT ME",
  "nav.projects": "PROJECTS",
  "about.bio1": "Hi! I am a developer specializing in web applications, websites, and PWAs. In my current job, I work as a front-end developer developing internal software for managing the departments of a railway company. After hours, I expand my knowledge and improve my skills by building my own applications and websites. I am also developing in machine and deep learning area, integrating these technologies with web development.",
  "about.bio2": "Below I present some of my side-projects, created as a part of my learning process using modern front-end technologies such as TypeScript, Angular, React.js and Tailwind CSS. All applications are hosted on a server configured by me. I use Node.js as the back-end and MongoDB as the database. In deep learning projects, I work with Python and PyTorch to build models and use Flask for the back-end. I develop applications following responsive web design pattern to display correctly on mobile devices.",
  "projects.digit": "Complete convolutional neural network powered application for recognizing handwritten digits in real-time. It's a showcase of skills in: designing and training simple neural model, building full-stack production-ready application hosted on a server and connecting AI technologies with web applications. You can install it on your phone (Progresive Web Application). The app recognises numbers handwritten in the browser or uploaded from file (black number on white background!)",
  "projects.radio": "The application is an online radio player streaming audio from 3rd party API. You can search station and play. After creating an account and log in you can add station to favourites, view the history of recently played stations and change password.",
  "projects.vocabularyquiz": "Language application that helps me learn english vocabulary after lessons. You can install it on your phone (Progresive Web Application). The app get list of categories from database and render categories on main page. After selecting a category, app get random 10 words or phrases from chosen category. For each word, the user provides a translation and checks its correctness. After the last answer, the result is given.",
  "projects.music": "Personal music website of my solo project. It's a lightweight, SSR application written in Next.js. It includes music player implemented from 3rd party API (SoundCloud).",
  "projects.ksmicroband": "Website of my last musical duo with custom music player. Features: get audio files from server by own API and play/stop/next/previous buttons. Autoplay next song and stop player after last song."
}
