{
  "nav.about": "O MNIE",
  "nav.technologies": "TECHNOLOGIE",
  "nav.projects": "PROJEKTY",
  "about.bio1": "Cześć! Jestem programistą aplikacji internetowych, stron WWW oraz aplikacji PWA. Pracuję jako front-end developer przy rozwoju wewnętrznego systemu do zarządzania działami firmy kolejowej. Po godzinach szlifuję umiejętności poprzez tworzenie własnych aplikacji i stron internetowych. Dodatkowo rozwijam się w obszarze uczenia maszynowego i głębokiego oraz łączę nabytą wiedzę z web developmentem.",
  "about.bio2": "Poniżej przedstawiam kilka swoich projektów wykonanych w nowoczesnych technologiach front-end'owych takich jak TypeScript, React.js, Next.js, Angular, czy Tailwindcss. Wszystkie aplikacje są umieszczone na własnym, skonfigutowanym przeze mnie serwerze. Wykorzystuję środowisko Node.js jako back-end oraz MongoDB jako bazę danych. Projekty z obszaru deep learning tworzę z wykorzystaniem Python i PyTorch do tworzenia modeli oraz Flask jako back-end. Aplikacje tworzę z zachowaniem zasad responsive web design, aby poprawnie wyświetlały się również na urządzeniach mobilnych.",
  "projects.digit": "Aplikacja oparta na konwolucyjnej sieci neuronowej do rozpoznawania odręcznych cyfr w czasie rzeczywistym. Przedstawia umiejętności w zakresie: projektowania i szkolenia prostego modelu neuronowego, budowania pełnej produkcyjnej aplikacji hostowanej na serwerze oraz łączenia technologii AI z aplikacjami internetowymi. Można ją zainstalować na telefonie (Progresive Web Application). Aplikacja umożliwia rozpoznanie odręcznych cyfer pisanych w przeglądarce oraz wgranych z pliku (czarna cyfra na białym tle!)",
  "projects.radio": "Internetowe radio pobierające strumień audio z zewnętrznego API. Pozwala na wyszukiwanie i włączenie stacji oraz utworzenie konta i logowanie, Po zalogowaniu można dodawać stacje do ulubionych (po zalogowaniu), podglądać historię ostatnio odtwarzanych stacji oraz zmienić hasło do konta.",
  "projects.vocabularyquiz": "Aplikacja językowa wspomagająca naukę słówek z lekcji angielskiego. Można ją zainstalować na telefonie (Progresive Web Application). Z bazy danych pobierana jest lista kategorii i wyświetlana na stronie głównej. Po wybraniu kategorii losowanych jest 10 słówek lub fraz z wybranej kategorii, Do każdego słówka użytkownik podaje tłumaczenie i sprawdza poprawność. Na końcu podana jest liczba poprawnych odpowiedzi",
  "projects.music": "Strona opisująca moją solową działalność muzyczną. Jest to lekka aplikacja napisana w Next.js wykorzystująca technologię SSR. W ramach stronych zaimplementowany jest odtwarzacz z zewnętrznego API (SoundCloud)",
  "projects.ksmicroband": "Strona mojego ostatniego duetu muzycznego z zaprogramowanym własnym odtwarzaczem. Opcje odtwarzacza: pobranie plików muzycznych z serwera przez własne API, przyciski play/stop/następny/poprzedni. Po zakończeniu utworu automatyczne rozpoczyna kolejny, a po ostatnim zatrzymuje odtwarzanie."
}
